p_bendPipe/uBend/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes // divergence schemes
{
    default         	none;
    div(phi,U)      	Gauss linearUpwind grad(U);
    div(phi,k)		Gauss linearUpwind grad(U);
    div(phi,omega)	Gauss linearUpwind grad(U);
    div(phi,nuTilda)	Gauss linearUpwind grad(U);
    // incompressible
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
    // potentialFoam
    div(div(phi,U))	Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
    nRequired true;
    updateInterval 1;
}

// ************************************************************************* //
